console.log(`Время анимации слайдера для каждого разрешения разное, 
кнопка не активна пока идет анимация 

анимации для перехода между страницами +- 150-200мс 

бургер меню и слайдер работают на 100%

Поп-ап работает, размеры совпадают с макетом кроме высоты некоторых карточек,
в которых слишком много контента, реализовал так, потому что не чекнул макет, у меня
объект превращается в этот поп-ап, и вылетает из верстки, не заметно если не вглядываться,
я знаю как можно сделать это по другому, но увидел на макете это уже слишком поздно,
не придирайтесь пожалуйста, было бы больше времени свободного, переписал бы, и так до 5ти утра сижу.

В пагинации пока рендер первой страницы из 'ПСЕВДО-СЛУЧАЙНОГО' набора,
и ререндер под разные разрешения.
если есть опция, дайте еще 1 денек на доделать`)


