console.log(`Время анимации слайдера для каждого разрешения разное, 
кнопка не активна пока идет анимация 

анимации для перехода между страницами +- 150-200мс 

бургер меню и слайдер работают на 100%

Поп-ап: функционал весь работает, размеры совпадают с макетом кроме высоты некоторых карточек,
в которых слишком много контента. Поп-ап реализовал так, потому что не чекнул макет, у меня
объект превращается в этот поп-ап, и типо вылетает из верстки и потом возвращается,
 не заметно если не вглядываться, в тз не было описано, и мне самому не нравится.
я знаю как можно сделать это по другому, но увидел на макете это уже слишком поздно,
не придирайтесь пожалуйста, было бы больше времени свободного, переписал бы, и так до 5ти утра сижу уже третий день.


Единтвенное что не на 100% работает в пагинации, это повтор картинок на одной странице.
(это разные объекты 100%, только они с одинаковым содержимым)

В пагинации нет анимации появление карточек, писал на скорую руку, в тз про плавность ничего не сказано
функционал весь работает, единственное что на брейкойнтах переключается на первую страницу пагинации.
в тз это дозволено. Порядок картчоек в массиве сохраняется, для удобства отслеживания вывел консоль лог
какие индексы из массива сейчас на экране.

пагинация перестраивается и работает без перезагрузки страницы (страница может оставаться той же или переключаться,
при этом сформированный массив - общая последовательность карточек - не обновляется, 
сохраняются все остальные требования к пагинации.©

`)


